OdDAI.Repository.readBuffer(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Creates repository from memory buffer that contains Step Physical File data.
\param pStream [in] A char array containing buffered model in Step Physical File representation.
\returns Returns eOk if the data was successfully read; otherwise, the method returns an appropriate error.

OdDAI.Repository.getReferenceSection
\details
Retrieves refence section.
\returns A reference to refence section.

OdDAI.Repository.getAnchorSection
\details
Retrieves anchor section.
\returns A reference to anchor section.